basic/controllers/SiteController.php

SELECT * FROM `texno` WHERE `id`='1'
---
    public function actionAddToCart()
    {
        $id = Yii::$app->request->post('id');
        $tovar = Texno::findOne($id);

INSERT INTO `orders` (`user_id`, `name`, `phone`, `address`, `items`, `total`, `status`, `created_at`) VALUES (5, 'фывфцв', 'ывфцвфыцвф', 'цвфывцф', '{\"items\":{\"1\":{\"id\":1,\"nazvan\":\"Samsung Galaxy S22 Ultra 512 \\u0413\\u0411 \",\"cena\":117497,\"quantity\":2}}}', 0, 'Pending', 1718394475)
---
    public function actionPlaceOrder()
    {
        $model = new OrderForm();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $order = new Order();
            $order->user_id = Yii::$app->user->id;
            $order->name = $model->name;
            $order->phone = $model->phone;
            $order->address = $model->address;
            $order->items = json_encode(Yii::$app->cart->getItems());
            $order->total = Yii::$app->cart->getTotal();
            $order->status = Order::STATUS_PENDING; // Set the default status
            $order->created_at = time();

            if ($order->save()) {

SELECT * FROM `texno`
---
    public function actionIndex()
    {
        $texnos = Texno::find()->all();